
CCNA
Cisco Certified Network Associate
EN
رفتن به مود perevilage
مود ادمین
Translating ...domain server
پیغام خطای دستور نامفهوم یا تعریف نشده برای روتر
برای عبور از این پیغام باید کلیدهایCtrl+Shift+6  را بزنیم
Configure terminal
رفتن به مود کانفیگ
مود پیکربندی و تنظیمات آی پی و روتینگ تیبل
Conf t
interface fastEthernet 0/0
شروع پیکربندی اترنت
برای تنظیم مقادیر آی پی و روتینگ و... در یک اترنت
int f0/1
ip address 192.168.1.1 255.255.255.0
آی پی دهی به یک اترنت
no shutdown
فعالسازی اترنت
برای فعال کردن یک اترنت یا پورت سخت افزاری باید حتما اجرا شود
no sh

show ip interface brief
خلاصه ای از وضعیت اترنت ها
نمایش آی پی و سایر وضعیت های پورت سخت افزاری و اترنت
Show ip int br
Ip route
تعریف route جدید
برای تعریف route جدید از این دستور استفاده میکنیم که در انتهاش یا باید آی پی روتر بعدی رو بزنیم یا اگر تنها یک روتر به اترنت وصل بود اترنت روتر فعلی رو بزنیم
Ip route 192.168.1.0 255.255.255.0 (f0/0 192.168.1.1)
no Ip route
حذف روت نوشته شده از Routing table
برای حذف route  نوشته شده باید عینن دستور اضافه کردن route رو بنویسیم با این تفاوت که در ابتدای دستور کلمه no را اضافه میکنیم
no Ip route 192.168.1.0 255.255.255.0 (f0/0 192.168.1.1)
show ip route (eigrp)
خلاصه وضعیت روتینگ تیبل(در مود روت #)
نمایش اطلاعات Routing Table دستگاه. در پروتکل مسیریابی RIP  با برچسب R  در ابتدای IPها مشخص میشوند.ولی در پروتکل EIGRP  با برچسب D .
Router1# show ip route eigrp
show ip protocols
خلاصه وضعیت روتینگ تیبل  و Next Router  در هر دست (در مود روت #)
R0#sh ip pro
show interface gigabitEthernet 0/0
نمایش اطلاعات اینترفیس
نمایش اطلاعات و جزئیات از یک اینترفیس مانند پهنای باند و Delay 
Router1# sh int g0/0

no ip add
حذف آی پی اترنت
برای پاک کردن آی پی اختصاص داده شدده به اترنت استفاده میشود
Do show ip route
نمایش Roting table در مود کانفیگ(conf)
نمایش همه Route های تعریف شده در Routing Table روتر
Administrative Distance
تعیین درجه اولویت برای Routeها
توسط این امکام میتوانیم تعریف کنیم که پکت ها در صورت وجود چندین مسیر به ترتیب از کدام مسیر در دسترس به سمت مقصد ارسال شوند.که بصورت یه عدد از 1 تا 254 میتوان در انتهای تعریف دستور Route اضافه شود.
Ip route 192.168.1.0 255.255.255.0 (f0/0 192.168.1.1)  11
Interface loopback name
یک loop back interface در واقع اینترفیسی Logical، Virtual است.
توسط این امکان میتوانیم به آن IP هم اختصاص دهیم.نکته اینکه اگر loopback interface  با IP Address 192.168.1.2/24 ایجاد می کنید و اگر قصد ایجاد loopback interfac دیگری در همان روتر دارید نبایدIP  آن در این Range باشد. مثلا loopback interfac بعدی را با آی پی 192.168.2.5 باید تعریف کنید.
تعریف IP مانند IPدهی به اینترفیس میباشد.
داینامیک Rout و استاتیک Route
Route های استاتیک بطور کامل دستی نوشته میشوند و هوشمند نیستند.Routeهای داینامیک بخشی دستی و الباقی خودکار شناسایی میشوند.Distance استاتیک معمولا 1 ولی داینامیک دارای اعداد بزرگتر از 1 است.اولویت همیشه با استاتیک است و در صورت وجود Route استاتیک برای یک رنج IP مقدار Route داینامیک آن مسیر خود به خود حذف میشود.مگر اینکه Distance  رو بالاتر از همه قرار دهیم.
تعریف داینامیک Route با روتینگ پروتکل RIP2
این روش ابتدایی ترین داینامیک Route میباشد که نیاز نیست در هر روتینگ تیبل روتر تمام روترها را معرفی و تعریف کنیم.
این پروتکل از روش Vector Distance بهره میبرد، یعنی برای مسیریابی مسیر با کمترین تعداد روتر رو انتخاب میکند.(Hop count)در این روش تنها در هر روتر باید نتورک های موجود در خود روتر را تعریف کنیم و توسط پکت ARP خود روتر به روترهای دیگر خود را معرفی میکند.حداکثر تعداد روتر در این مدل 15 عدد میباشد.
  ```bash
R0(config-if)#  router rip 
R0(config-router)#  Version 2
R0(config-router)#  Network 192.168.1.0
, …
  ```
Distacne
تغییر اولویت یک مسیر در مسیریابی 
توسط این دستور میتوانیم اولویت یا Distance  یه پروتکل مسیریابی رو تغییر بدیم.مثلا ابتدا پروتک RIP رو راه اندازی کردیم و حالا میخواهیم OSPF رو راه اندازی کنیم که باعث میشود در حین تنظیمات مسیریابی به مشکل بخورد زیرا Distance پروتکل روتینگ OSPF بصورت پیش فرض 110  و کمتر RIP  که120 میباشد است.بنابراین با این دستور ابتدا Distance  پروتکل RIP رو کمتر میکنیم و بعد از نهایی شدن کانفیگ دوباره به حالت اول برمیگردونیم
R0(config-if)#  router rip 
R0(config-router)#  dis 80

passive-interface
برای پسیو کردن یک اینترفیس در روتر
در روتینگ پروتکل‌ها پکت ARP به همه اینترفیس های تعریف شده در Routing Table ارسال میشود اگر بعد از یک ایترفیس در روتر،سوئیچ باشد نیازی به ارسال پکت ARP نیست. بنابراین باید اون اینترفیس رو به عنوان پسیو تعریف کنیم تا پکت های ARP از آن عبور نکند. و برای برگردوندن کافی ابتدای دستور زیر عبارت no رو قرار بدیم.
R0(config-if)#  router rip 
R0(config-router)#passive-interface g0/0
R0(config-router)#no passive-interface g0/0
timers basic 5 30 30 60
تغییر تایم ارسال بسته های ARP در روتینگ پروتکل
برای کم و زیاد کردن تایم ارسال پکت ها و همچنین بروزرسانی و یا حذف Route های قطع شده میتوان از این دستور بصورت زیر استفاده کرد.به ترتیب
 Update, Invalid, HoldTime,Flushed هستند.
برای بازگشت به حالت پیش فرض نیز میتوان عبارت no را در ابتدای دستور اضافه کرد.
R0(config-router)# timers basic 5 30 30 60
R0(config-router)# no timers basic
دستور auto-summery
در ارسال پکت های شنسایی روتر perfix بصورت کلاس فول ارسال میشود.مثلا 10.0.0.0
در شبکه های Classful و Routing protocol هایی از شبکه های Classful فقط پشتیبانی می شود.مثل Rip1 و IGRP اما در RIP2  و EIGRP باید همیشه غرفعال شود.هرچند در روترهای جدید و آپدیت غیرفعال است.
R0(config-router)# no auto-summery

Clear ip router *
حذف جداول مسیریابی تعریف شده 
برای حذف کامل جدل مسیریابی از دستور زیر استفاده میکنیم
Router1#clear ip route *
Router EIGRP ASNumber
تعریف پروتکل مسیریابی EIGRP
در دستور زیر برای تعریف پروتکل مسیریابی EIGRP باید ASNumber نیز درج شود. روتر های با Autonomous system number  مشابه میتوانند یکدیگر را ببیند و جداول مسیریابی را برای یکدیگر و شناسایی ارسال میکنند.این آیتم برای جداکردن شبکه ها میباشد تا با Asnumber  بتوان شبکه ها را گروه بندی و ایزوله کرد.
در این پروتکل Distance Admin عدد 90 است.متریک نیز بر اساس Delay ,Bandwith محاسبه میکند.بنابراین مسیر های گیگابایت بر FastEthernet  و مسیر سریال اولویت دارد زیرا پهنای باند و Delay کمتری دارد حتی اگر تعداد روترهای مسیر بیشتر از مسیر کندتر باشد.
Router1#router eigrp 100
network 192.168.1.0

show ip EIGRP neighbors
نمایش  IP روترهای همسایه روتر فعلی
با این دستور لیست روترهای همسایه را میتوانیم ببینیم
Router1# sh ip ei ne
دستور Bandwith , Delay
تغییر پهنای باند و تاخیر
از این دستور برای تغییر پنای باند و تاخیر ک اینترفیس استفاده میکنیم.در مورد عدد بعد از Delay این نکتهمهم ااست که عدد ورودی در 10 ضرب میشود.برای مشاهده تغییر هم میتوانیم از دستور زیر استفاده کنیم.
Router1(config-if)#bandwidth 1000000
Router1(config-if)#delay 1
do sho interface s0/0/0
no router eigrp <ASN>
حذف روتینگ پروتکل EIGRP
برای حذف روتینگ پروتکل و جداول مسیریابی EIGRP  از این دستور استفاده میکنیم
Router1(config)#router eigrp 100

Router OSPF <ProcessNumber>
برای تعریف روتینگ پروتکل OSPF
از ایندستور برای راه اندازی Routing Protocol OSPF استفاده میکنیم.عدد ProcessNumber توضیح خاصی ندارد و برای لاگ گیری مورد استفاده قرار میگیرد.در این پروتکل علاوه برا مزیت های EIGRP میتوان روترهایی یا چندین دسته بندی مشترک و سینگل تعریف کرد.برای تعریف جداول مسیریابی نیز باید از دستور Network  استفاده کرد که بعد از آن IP میدهیم و سپس VildCard که برعکس SubnetMask میباشد.بعد از آن عبارت Area  و بعد شماره مربوط به Area یا دسته بندی را میزنیم که حتما باید از صفر شروع شود.
در این پروتکل متریک بر اساس Cost و یا فقطbandwidth  محاسبه میشود.مسیرهای این پروتکل نیز با برچشب O نمایش داده میشود.
Router1(config)#router ospf 1
Router1(config-router)#network 192.168.1.0 0.0.0.255 area 0


ip ospf cost 1
تغییر Cost بصورت دستی
با این دستور میتوانیم Cost یک اینترفیس را بصورت دستی تغییر دهیم.بنابراین میتوانیم با این دستور در اولویت مسیریابی روتر تغییرات ایجاد کنیم.
Router1(config)#int g0/1
Router1(config-if)#ip ospf cost 1
router-id 2.2.2.2
تغییر نام روتر آی دی
با این دستور میتوانیم Router ID را که در جداول neighbor نشان داده شده را تغییر دهیم.بصورت پیش فرض این آی دی بزرگترین آی پی در میان اینترفیس های روتر است.اما اگر لوپ بک داشته باشیم اولویت با آی پی loopback میباشد.
R4(config-router)#router-id 2.2.2.2
R4#clear ip ospf process
access-list
برای نوشتن دسترسی یا محدودیت های خاص روی شبکه
از این دستور برای نوشتن Rule در جهت محدودسازی دسترسی در شبکه استفاده میکنیم.بطور مثال یک IP به IP دیگر یا شبکه ی دیگری دسترسی نداشته باشد و پکت های ارسالی آن Deny شود.این دستور در 2 مدل Standard و Extended استفاده میشود که Extended مدل مناسب و کاملتری است.شماره 1-99 مربوط به Standard و 100-199 مربوط به Extended  میباشد.
ابتدا باید Rule برای محدودیت ها نوشته شود سپس برای دسترسی ها وگرنه هیچ پکتی به جز محدودیت ها بررسی نمیشود.بعد از نوشتن Rule باید ACL را به Inbound یا Outbound یک اینترفیس اختصاص دهیم تا اعمال شود.
در نوشت Rule هم میتوانیم IP بنویسیم هم IP Range
R4(config)#access-list 101 deny ip host 192.168.2.4 192.168.1.0 0.0.0.255 
R4(config)#access-list 101 permit ip any any
R4(config)#int g0/1
R4(config-if)#ip access-group 101 in
R4(config-if)#do sh acc

ip access-list <extended> <101> 
حذف لاین مربوط به Rule نوشته شده در ACL
برای حذف یک خط از Ruleهای نوشته شده درACL  از دستورات زیر استفاده میکنیم.برای حذف همه از دستور no access-list 101
Router1(config)#ip access-list extended 101
Router1(config-ext-nacl)#no 30
برای نمایش لیست ASLها از دستور زیر استفاده میکنیم:
R4(config-if)#do sh acc
برای فهمیدن اینکه کدام ACL روی کدام اینترفیس درحال اجرا است میتوانیم از یکی از دستورهای زیر استفاده کنیم:
show ip interface gigabitEthernet 0/2
show running-config
NAT Routing
برای اتصال سیستم های شبکه داخلی به اینترنت استفاده میشود.
برای تعریف NAT ابتدا 3 مرحله را انجام دهیم:
1-	نوشتن Default Route
2-	مشخص کردن اینترفیس های Inside ,Outside
3-	 تعریف ACL و معرفی آن به NAT
برای شروع باید Default Route بنویسیم .
Router(config)#ip route 0.0.0.0 0.0.0.0 192.168.1.1
آی پی درج شده IP Next Hop سمت اینترنت روتر میباشد.
مرحله بعد تعریف کردن اینترفیس های داخلی و خارجی برای روتر.سمت شبکه داخلی Inside و سمت اینترفیسی که به اینترنت متصل است Outside میباشد.
Router(config)#int g0/0
Router(config-if)#ip nat inside
Router(config)#int g0/1
Router(config-if)#ip nat outside 
در مرحله بعد باید ASL از نوع استاندارد بنویسیم چون نیاز به Destination نداریم و رنج IP های مجاز برای دسترسی به اینترنت رو فقط مینویسیم.
Router(config)#access-list 10 permit 192.168.1.0 0.0.0.255
در مرحله بعد ACL رو به NAT معرفی میکنیم.نکته اینکه در انتهای دستور باید نام Outside Interface را بنویسیم.
Router(config)#ip nat inside source list 10 interface g0/1

show running-config
برای مشاهده تنظیمات اعمال شده در روتر 
برای مشاهده دستورات نوشته شده و تنظیمات روتر از این دستور استفاده میکنیم
Router#sh running-config 
Router#sh startup-config 
copy running-config startup-config
ذخیره تنظیمات اعمال شده روی روتر
برای ذخیره دستورات و تنظیمات اعمال شده در روتر برای اینکه با خاموش و روشن شدن روتر پاک نشوند از دستور زیر استفاده میکنیم.بدین ترتیب در Startup روتر ذخیره میشود.یا با دستور Write  که معادل دستور زیر است.
Router#copy running-config startup-config 
Router#write
Reload
ریست (خاموش روشن کردن) روتر
برای خاموش روشن کردن روتر از این دستور استفاده میکنیم.قبل از Reload تنظیمات ذخیره شود وگرنه تنها موارد داخل Startup هنگام روشن شدن بود میشود.
Router#reload
erase startup-config
پاک کردن کانفیگ درون Startup
با این دستور تمام دستورها و تنظیمات داخل StartupConfig پاک میشود
R1#erase startup-config
و یا 
R1#write erase
enable secret <password>
برای گذاشتن پسورد روی روتر
برا گذاشتن پسورد روی روتر میتوانیم از دستور Secrect یا Password  استفاده کنیم.تفائت این دو این است که Secret  بصورت رمزشده در کانفیگ روتر ذخیره و نمایش داده میشود و نمیتوان آن را بصورت PlainText دید.اماpassword  اینطور نیست و بصورت متن خام در کانفیگ روتر ذخیره و دیده میشود.اگر همردو تعریف شده باشند اولویت با Secret  میباشد.
Router(config)#enable secret 123
Router(config)#enable password 123
برای حذف پسوردها نیز از دستور زیر استفاده میکنیم
Router(config)#no enable secret 
Router(config)#no enable password

Username
ساخت یوزر و تعیین دسترسی به ترمینال روتر
باری تعریف یوزر و تعیین دسترسی به ترمینال روتر از دستورات زیر استفاده میکنیم.در گام اول سوزر و پسورد رو تعریف میکنیم.
R1(config)#username admin password 123
در مرحله بعد باید دسترسی یوزر رو تعیین کنیم
R1(config)#username admin privilege 15
در مرحله بعد باید عنوان کنیم که چه تعداد کانکشن همزمان میتوانیم برای اتصال به ترمینال داشته باشیم و همچنین لیست یوزرها را به لاگین معرفی کنیم.
R1(config)#line vty 0 2
R1(config-line)#login local

cdp neighbors
نمایش لیست دستگاه‌های مجاور روتر
برای نمایش لیست دیوایس هایی که به اینترفیس های روتر متصل هستند،اعم از روترها و سوییچ های دیگر رو نمایش میده
R1#sh cdp neighbors 
R1#sh cdp neighbors detail 

